[
    {
        "title": {
            "indonesian": "Legenda Danau Toba",
            "english": "Legend of Lake Toba"
        },
        "synopsis": {
            "indonesian": "Di jantung sebuah pulau tropis yang lebat, sebuah legenda berkisah tentang seekor siput sederhana yang berkat kebajikan dan keikhlasan yang tak tergoyahkan, memperoleh transformasi luar biasa. Keong Emas adalah sebuah kisah memikat yang merayakan kekuatan kebaikan hati dan mengajarkan pelajaran abadi bahwa kecantikan sejati terletak di dalam diri.",
            "english": "In the heart of the mystical island of Sumatra, a legend whispers of the ancient guardians who watch over the majestic Lake Toba. This tale weaves together the threads of nature's power, human folly, and the enduring bond between mortals and the divine."
        },
        "story_path": {
            "english": "legend-of-lake-toba-english",
            "indonesian": "legend-of-lake-toba-indonesian"
        },
        "id": {
            "english": "legend-of-lake-toba",
            "indonesian": "legenda-danau-toba"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Malin Kundang",
            "english": "Legend of Malin Kundang"
        },
        "synopsis": {
            "indonesian": "Di desa pesisir Air Manis, seorang janda miskin bernama Mande Rubayah membesarkan putranya, Malin Kundang, dengan cinta dan pengorbanan yang tak kenal lelah. Meskipun hidup dalam kemiskinan, dia menanamkan nilai-nilai rasa syukur dan kerendahan hati pada putranya. Namun, seiring bertambahnya usia dan meninggalkan kampung halaman, Malin Kundang menjadi serakah dan ambisius, melupakan pelajaran yang diajarkan ibunya.",
            "english": "In the coastal village of Air Manis, a poor widow named Mande Rubayah raised her son, Malin Kundang, with unwavering love and sacrifice. Despite their humble circumstances, she instilled in him the values of gratitude and humility. However, as Malin Kundang grew older and ventured into the world, he became consumed by greed and ambition, forgetting the lessons his mother had taught him."
        },
        "story_path": {
            "english": "legend-of-malin-kundang-english",
            "indonesian": "legend-of-malin-kundang-indonesian"
        },
        "id": {
            "english": "legend-of-malin-kundang",
            "indonesian": "legenda-malin-kundang"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Roro Jonggrang",
            "english": "Legend of Roro Jonggrang"
        },
        "synopsis": {
            "indonesian": "Seorang putri cantik bernama Roro Jonggrang meminta seorang pangeran untuk membangun seribu candi dalam satu malam sebagai syarat pernikahan. Pangeran hampir berhasil, namun Roro Jonggrang menggagalkan usahanya.",
            "english": "A beautiful princess named Roro Jonggrang asks a prince to build a thousand temples in one night as a condition for marriage. The prince almost succeeds, but Roro Jonggrang foils his effort."
        },
        "story_path": {
            "english": "legend-of-roro-jonggrang-english",
            "indonesian": "legend-of-roro-jonggrang-indonesian"
        },
        "id": {
            "english": "legend-of-roro-jonggrang",
            "indonesian": "legenda-roro-jonggrang"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Tangkuban Perahu",
            "english": "Legend of Tangkuban Perahu"
        },
        "synopsis": {
            "indonesian": "Seorang pemuda bernama Sangkuriang tanpa sadar jatuh cinta pada ibunya sendiri. Setelah mengetahui kebenarannya, sang ibu memberi syarat yang mustahil yang akhirnya membentuk Gunung Tangkuban Perahu.",
            "english": "A young man named Sangkuriang unknowingly falls in love with his own mother. Upon discovering the truth, his mother sets an impossible condition that eventually leads to the formation of Mount Tangkuban Perahu."
        },
        "story_path": {
            "english": "legend-of-tangkuban-perahu-english",
            "indonesian": "legend-of-tangkuban-perahu-indonesian"
        },
        "id": {
            "english": "legend-of-tangkuban-perahu",
            "indonesian": "legenda-tangkuban-perahu"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Timun Mas",
            "english": "Legend of Timun Mas"
        },
        "synopsis": {
            "indonesian": "Seorang wanita tua menerima seorang anak dari biji timun ajaib. Anak itu, Timun Mas, harus melarikan diri dari raksasa yang ingin memakannya.",
            "english": "An old woman receives a child from a magical cucumber seed. That child, Timun Mas, must flee from a giant who wants to eat her."
        },
        "story_path": {
            "english": "legend-of-timun-mas-english",
            "indonesian": "legend-of-timun-mas-indonesian"
        },
        "id": {
            "english": "legend-of-timun-mas",
            "indonesian": "legenda-timun-mas"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Keong Mas",
            "english": "Legend of Keong Mas"
        },
        "synopsis": {
            "indonesian": "Seorang putri cantik dikutuk menjadi keong emas oleh penyihir jahat. Keong emas itu ditemukan oleh seorang wanita tua yang merawatnya sampai kutukan itu terangkat.",
            "english": "A beautiful princess is cursed to become a golden snail by an evil witch. The golden snail is found by an old woman who cares for it until the curse is lifted."
        },
        "story_path": {
            "english": "legend-of-keong-mas-english",
            "indonesian": "legend-of-keong-mas-indonesian"
        },
        "id": {
            "english": "legend-of-keong-mas",
            "indonesian": "legenda-keong-mas"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Banyuwangi",
            "english": "Legend of Banyuwangi"
        },
        "synopsis": {
            "indonesian": "Seorang raja menuduh istrinya yang setia berselingkuh. Istrinya membuktikan kesuciannya dengan menceburkan diri ke sungai, dan air sungai itu menjadi jernih dan harum.",
            "english": "A king accuses his faithful wife of infidelity. His wife proves her purity by throwing herself into a river, and the river's water becomes clear and fragrant."
        },
        "story_path": {
            "english": "legend-of-banyuwangi-english",
            "indonesian": "legend-of-banyuwangi-indonesian"
        },
        "id": {
            "english": "legend-of-banyuwangi",
            "indonesian": "legenda-banyuwangi"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Asal Usul Kota Surabaya",
            "english": "Legend of the Origin of Surabaya"
        },
        "synopsis": {
            "indonesian": "Seekor buaya dan seekor hiu berseteru untuk menjadi penguasa wilayah. Pertarungan mereka menghasilkan nama kota Surabaya.",
            "english": "A crocodile and a shark dispute to become the ruler of the territory. Their battle gives rise to the name of the city Surabaya."
        },
        "story_path": {
            "english": "legend-of-the-origin-of-surabaya-english",
            "indonesian": "legend-of-the-origin-of-surabaya-indonesian"
        },
        "id": {
            "english": "legend-of-the-origin-of-surabaya",
            "indonesian": "legenda-asal-usul-kota-surabaya"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Jaka Tarub dan Nawang Wulan",
            "english": "Legend of Jaka Tarub and Nawang Wulan"
        },
        "synopsis": {
            "indonesian": "Seorang pemuda bernama Jaka Tarub mencuri selendang seorang bidadari bernama Nawang Wulan. Mereka menikah, tetapi rahasia itu akhirnya terbongkar.",
            "english": "A young man named Jaka Tarub steals the shawl of a celestial nymph named Nawang Wulan. They marry, but the secret is eventually revealed."
        },
        "story_path": {
            "english": "legend-of-jaka-tarub-and-nawang-wulan-english",
            "indonesian": "legend-of-jaka-tarub-and-nawang-wulan-indonesian"
        },
        "id": {
            "english": "legend-of-jaka-tarub-and-nawang-wulan",
            "indonesian": "legenda-jaka-tarub-dan-nawang-wulan"
        }
    }
]