[
    {
        "title": {
            "indonesian": "Legenda Danau Toba",
            "english": "Legend of Lake Toba"
        },
        "synopsis": {
            "indonesian": "Seorang pemuda bernama Toba menikahi seorang putri ikan. Mereka memiliki seorang anak, namun Toba melanggar janjinya kepada istrinya, yang menyebabkan bencana besar yang membentuk Danau Toba.",
            "english": "A young man named Toba marries a fish princess. They have a son, but Toba breaks a promise to his wife, leading to a great disaster that forms Lake Toba."
        },
        "full_story": {
            "indonesian": "Dahulu kala, di Sumatera Utara, hiduplah seorang pemuda bernama Toba yang tinggal sendirian dan bekerja sebagai petani. Suatu hari, Toba memutuskan untuk memancing di sungai. Setelah menunggu lama, ia menangkap ikan besar yang sangat indah. Toba sangat senang dan membawa ikan itu pulang. Ketika Toba hendak memasak ikan tersebut, ia terkejut karena ikan itu berubah menjadi seorang wanita cantik. Wanita itu berkata, 'Aku adalah putri ikan. Jika kamu ingin menikahiku, jangan pernah memberi tahu siapapun tentang asal usulku.' Toba setuju dan mereka pun menikah. Mereka hidup bahagia dan memiliki seorang anak bernama Samosir. Samosir adalah anak yang sangat aktif dan sering membuat masalah. Suatu hari, Samosir memakan bekal ayahnya yang seharusnya dibawa ke ladang. Toba sangat marah dan tanpa sengaja berteriak, 'Dasar anak ikan!' Samosir yang terkejut bertanya kepada ibunya tentang kebenaran itu. Ibunya yang mendengar hal itu merasa sangat sedih dan marah karena Toba telah melanggar janjinya. Ia kemudian meminta Samosir untuk berlari ke bukit. Ia sendiri pergi ke sungai dan kembali menjadi ikan. Hujan deras turun, dan sungai meluap, menenggelamkan desa mereka. Tempat itu kemudian menjadi Danau Toba, dan pulau di tengahnya dikenal sebagai Pulau Samosir. Hingga kini, Danau Toba menjadi salah satu tempat wisata terkenal di Indonesia.",
            "english": "Long ago, in North Sumatra, there was a young man named Toba who lived alone and worked as a farmer. One day, Toba decided to fish in the river. After waiting a long time, he caught a large, beautiful fish. Toba was very happy and took the fish home. When Toba was about to cook the fish, he was shocked because the fish turned into a beautiful woman. The woman said, 'I am the fish princess. If you want to marry me, never tell anyone about my origin.' Toba agreed and they got married. They lived happily and had a son named Samosir. Samosir was an active child and often caused trouble. One day, Samosir ate his father's lunch, which was supposed to be taken to the field. Toba was very angry and accidentally shouted, 'You son of a fish!' Samosir, who was shocked, asked his mother about the truth. His mother, who heard this, was very sad and angry because Toba had broken his promise. She then asked Samosir to run to the hill. She herself went to the river and turned back into a fish. Heavy rain poured down, and the river overflowed, drowning their village. The place then became Lake Toba, and the island in the middle was known as Samosir Island. Today, Lake Toba is one of the famous tourist spots in Indonesia."
        },
        "id": {
            "english": "legend-of-lake-toba",
            "indonesian": "legenda-danau-toba"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Malin Kundang",
            "english": "Legend of Malin Kundang"
        },
        "synopsis": {
            "indonesian": "Seorang pemuda bernama Malin Kundang tidak menghormati ibunya setelah menjadi kaya. Sebagai akibatnya, dia dikutuk dan berubah menjadi batu oleh ibunya.",
            "english": "A young man named Malin Kundang disrespects his mother after becoming rich. As a result, he is cursed and turned into stone by his mother."
        },
        "full_story": {
            "indonesian": "Di sebuah desa kecil di Sumatera Barat, hiduplah seorang janda dan anaknya bernama Malin Kundang. Mereka sangat miskin, dan Malin sering membantu ibunya bekerja di ladang. Suatu hari, Malin memutuskan untuk pergi ke kota untuk mengubah nasibnya dan membantu ibunya. Tahun-tahun berlalu, dan Malin menjadi sangat sukses dan kaya. Ia memutuskan untuk kembali ke desanya dengan kapal besar dan banyak harta. Ketika kapal tiba, ibunya sangat bahagia dan berlari menemui Malin. Namun, Malin yang merasa malu dengan penampilan ibunya yang miskin menolak mengakui ibunya. Ibunya sangat sedih dan marah dengan perilaku Malin. Dalam kesedihannya, ia berdoa kepada Tuhan agar Malin dihukum karena ketidakberbaktiannya. Tak lama kemudian, langit menjadi gelap, dan badai besar menghantam kapal Malin. Malin dan kapalnya perlahan berubah menjadi batu. Hingga saat ini, batu yang menyerupai seorang pria dengan kapal besar di Pantai Air Manis, Padang, diyakini sebagai Malin Kundang yang dikutuk. Cerita ini mengajarkan kita untuk selalu menghormati dan menyayangi orang tua.",
            "english": "In a small village in West Sumatra, there lived a widow and her son named Malin Kundang. They were very poor, and Malin often helped his mother work in the fields. One day, Malin decided to go to the city to change his fate and help his mother. Years passed, and Malin became very successful and wealthy. He decided to return to his village with a big ship and lots of treasures. When the ship arrived, his mother was very happy and ran to meet Malin. However, Malin, feeling ashamed of his mother's poor appearance, refused to acknowledge her. His mother was very sad and angry at Malin's behavior. In her sorrow, she prayed to God to punish Malin for his disrespect. Soon after, the sky turned dark, and a big storm hit Malin's ship. Malin and his ship slowly turned into stone. To this day, a stone resembling a man with a big ship at Air Manis Beach in Padang is believed to be Malin Kundang, who was cursed. This story teaches us to always respect and love our parents."
        },
        "id": {
            "english": "legend-of-malin-kundang",
            "indonesian": "legenda-malin-kundang"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Roro Jonggrang",
            "english": "Legend of Roro Jonggrang"
        },
        "synopsis": {
            "indonesian": "Seorang putri cantik bernama Roro Jonggrang meminta seorang pangeran untuk membangun seribu candi dalam satu malam sebagai syarat pernikahan. Pangeran hampir berhasil, namun Roro Jonggrang menggagalkan usahanya.",
            "english": "A beautiful princess named Roro Jonggrang asks a prince to build a thousand temples in one night as a condition for marriage. The prince almost succeeds, but Roro Jonggrang foils his effort."
        },
        "full_story": {
            "indonesian": "Di Kerajaan Prambanan, hiduplah seorang putri cantik bernama Roro Jonggrang. Ia adalah putri dari Raja Boko yang terkenal bijaksana. Suatu hari, seorang pangeran bernama Bandung Bondowoso datang untuk melamar Roro Jonggrang. Bandung Bondowoso adalah pangeran yang sangat kuat dan telah menaklukkan banyak kerajaan. Roro Jonggrang tidak ingin menikah dengan Bandung Bondowoso, tetapi ia tidak bisa menolaknya secara langsung. Akhirnya, ia memberikan syarat yang mustahil: Bandung Bondowoso harus membangun seribu candi dalam satu malam. Pangeran yang percaya diri itu setuju dan mulai bekerja dengan bantuan makhluk gaib. Dengan kekuatan mereka, mereka membangun candi dengan cepat. Roro Jonggrang yang melihat hal itu menjadi cemas. Ia berencana menggagalkan usaha pangeran itu. Roro Jonggrang meminta para wanita di desa untuk menumbuk padi dan menyalakan api sebagai tanda bahwa fajar telah tiba. Ayam-ayam mulai berkokok. Makhluk gaib berhenti bekerja, mengira itu sudah pagi, tetapi mereka hanya berhasil menyelesaikan 999 candi. Bandung Bondowoso sangat marah ketika menyadari bahwa Roro Jonggrang telah menipunya. Ia mengutuk Roro Jonggrang menjadi candi yang keseribu. Candi ini masih ada hingga sekarang dan dikenal sebagai Candi Roro Jonggrang di kompleks Candi Prambanan.",
            "english": "In the Prambanan Kingdom, there lived a beautiful princess named Roro Jonggrang. She was the daughter of King Boko, known for his wisdom. One day, a prince named Bandung Bondowoso came to propose to Roro Jonggrang. Bandung Bondowoso was a powerful prince who had conquered many kingdoms. Roro Jonggrang did not want to marry Bandung Bondowoso, but she could not refuse him directly. Finally, she gave an impossible condition: Bandung Bondowoso had to build a thousand temples in one night. The confident prince agreed and started working with the help of supernatural beings. With their power, they built temples quickly. Roro Jonggrang, seeing this, became anxious. She planned to foil the prince's effort. Roro Jonggrang asked the women in the village to pound rice and light fires as a sign that dawn had arrived. The roosters started crowing. The supernatural beings stopped working, thinking it was morning, but they had only completed 999 temples. Bandung Bondowoso was very angry when he realized that Roro Jonggrang had deceived him. He cursed Roro Jonggrang to become the thousandth temple. This temple still exists today and is known as Roro Jonggrang Temple in the Prambanan Temple complex."
        },
        "id": {
            "english": "legend-of-roro-jonggrang",
            "indonesian": "legenda-roro-jonggrang"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Tangkuban Perahu",
            "english": "Legend of Tangkuban Perahu"
        },
        "synopsis": {
            "indonesian": "Seorang pemuda bernama Sangkuriang tanpa sadar jatuh cinta pada ibunya sendiri. Setelah mengetahui kebenarannya, sang ibu memberi syarat yang mustahil yang akhirnya membentuk Gunung Tangkuban Perahu.",
            "english": "A young man named Sangkuriang unknowingly falls in love with his own mother. Upon discovering the truth, his mother sets an impossible condition that eventually leads to the formation of Mount Tangkuban Perahu."
        },
        "full_story": {
            "indonesian": "Dahulu kala, di Jawa Barat, hiduplah seorang pemuda bernama Sangkuriang. Ia adalah anak dari seorang wanita cantik bernama Dayang Sumbi. Sangkuriang tidak tahu bahwa Dayang Sumbi adalah ibunya karena mereka telah terpisah lama. Suatu hari, Sangkuriang bertemu Dayang Sumbi dan jatuh cinta padanya. Dayang Sumbi juga tidak mengenali Sangkuriang sebagai anaknya. Namun, saat mereka akan menikah, Dayang Sumbi melihat bekas luka di kepala Sangkuriang yang mengingatkannya pada anaknya yang hilang. Dayang Sumbi sadar bahwa Sangkuriang adalah anaknya dan merasa sangat sedih dan bingung. Untuk menghindari pernikahan itu, Dayang Sumbi memberikan syarat yang mustahil kepada Sangkuriang: ia harus membuat perahu dan danau dalam satu malam. Sangkuriang dengan kekuatan gaibnya hampir menyelesaikan tugas itu. Dayang Sumbi kemudian membuat fajar palsu dengan menyalakan api dan membuat ayam berkokok. Makhluk gaib berhenti bekerja karena mengira hari sudah pagi. Sangkuriang yang marah karena gagal menendang perahu yang telah dibuatnya hingga terbalik. Perahu itu menjadi gunung yang sekarang dikenal sebagai Gunung Tangkuban Perahu yang berarti 'perahu terbalik'.",
            "english": "Long ago, in West Java, there lived a young man named Sangkuriang. He was the son of a beautiful woman named Dayang Sumbi. Sangkuriang did not know that Dayang Sumbi was his mother because they had been separated for a long time. One day, Sangkuriang met Dayang Sumbi and fell in love with her. Dayang Sumbi also did not recognize Sangkuriang as her son. However, when they were about to marry, Dayang Sumbi saw a scar on Sangkuriang's head that reminded her of her long-lost son. Dayang Sumbi realized that Sangkuriang was her son and felt very sad and confused. To avoid the marriage, Dayang Sumbi set an impossible condition for Sangkuriang: he had to build a boat and a lake in one night. Sangkuriang, with his supernatural power, almost completed the task. Dayang Sumbi then created a false dawn by lighting fires and making roosters crow. The supernatural beings stopped working, thinking it was morning. Sangkuriang, who was furious because he failed, kicked the boat he had made until it overturned. The boat became a mountain now known as Mount Tangkuban Perahu, which means 'overturned boat.'"
        },
        "id": {
            "english": "legend-of-tangkuban-perahu",
            "indonesian": "legenda-tangkuban-perahu"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Timun Mas",
            "english": "Legend of Timun Mas"
        },
        "synopsis": {
            "indonesian": "Seorang wanita tua menerima seorang anak dari biji timun ajaib. Anak itu, Timun Mas, harus melarikan diri dari raksasa yang ingin memakannya.",
            "english": "An old woman receives a child from a magical cucumber seed. That child, Timun Mas, must flee from a giant who wants to eat her."
        },
        "full_story": {
            "indonesian": "Di sebuah desa, hiduplah seorang wanita tua yang sangat ingin memiliki anak. Suatu hari, seorang raksasa memberikan biji timun kepadanya dan berkata, 'Tanamlah biji ini, maka kamu akan memiliki anak. Tapi ketika ia dewasa, aku akan mengambilnya.' Wanita tua itu setuju dan menanam biji tersebut. Biji itu tumbuh menjadi timun besar, dan ketika dipotong, keluar seorang bayi perempuan. Wanita tua itu menamainya Timun Mas. Wanita tua itu merawat Timun Mas dengan penuh kasih. Ketika Timun Mas dewasa, raksasa datang untuk mengambilnya. Wanita tua itu sangat takut dan mencari bantuan dari seorang pertapa. Pertapa itu memberikan empat bungkusan yang berisi biji timun, jarum, garam, dan terasi. Saat dikejar raksasa, Timun Mas melemparkan biji timun yang berubah menjadi hutan timun yang lebat. Namun, raksasa berhasil melewatinya. Timun Mas lalu melemparkan jarum yang berubah menjadi hutan bambu berduri. Raksasa terluka tetapi tetap bisa melewatinya. Timun Mas terus berlari dan melemparkan garam yang berubah menjadi laut. Raksasa masih berhasil berenang melewatinya. Akhirnya, Timun Mas melemparkan terasi yang berubah menjadi danau lumpur mendidih. Raksasa terjebak dan tenggelam di dalamnya. Timun Mas pun selamat dan kembali ke rumah untuk hidup bahagia bersama ibunya.",
            "english": "In a village, there lived an old woman who desperately wanted a child. One day, a giant gave her a cucumber seed and said, 'Plant this seed, and you will have a child. But when she grows up, I will take her.' The old woman agreed and planted the seed. The seed grew into a big cucumber, and when it was cut open, a baby girl came out. The old woman named her Timun Mas. The old woman cared for Timun Mas with love. When Timun Mas grew up, the giant came to claim her. The old woman was very afraid and sought help from a hermit. The hermit gave Timun Mas four bundles containing cucumber seeds, needles, salt, and shrimp paste. When the giant chased her, Timun Mas threw the cucumber seeds, which turned into a dense cucumber forest. However, the giant managed to pass through it. Timun Mas then threw the needles, which turned into a bamboo forest with sharp thorns. The giant got hurt but still managed to get through. Timun Mas kept running and threw the salt, which turned into a sea. The giant still managed to swim through it. Finally, Timun Mas threw the shrimp paste, which turned into a boiling mud lake. The giant got stuck and sank in it. Timun Mas was safe and returned home to live happily with her mother."
        },
        "id": {
            "english": "legend-of-timun-mas",
            "indonesian": "legenda-timun-mas"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Keong Mas",
            "english": "Legend of Keong Mas"
        },
        "synopsis": {
            "indonesian": "Seorang putri cantik dikutuk menjadi keong emas oleh penyihir jahat. Keong emas itu ditemukan oleh seorang wanita tua yang merawatnya sampai kutukan itu terangkat.",
            "english": "A beautiful princess is cursed to become a golden snail by an evil witch. The golden snail is found by an old woman who cares for it until the curse is lifted."
        },
        "full_story": {
            "indonesian": "Di kerajaan Daha, hiduplah seorang putri cantik bernama Candra Kirana. Ia memiliki saudara tiri bernama Galuh Ajeng yang sangat cemburu padanya. Suatu hari, Galuh Ajeng bersekongkol dengan penyihir jahat untuk mengutuk Candra Kirana menjadi keong emas. Keong emas itu hanyut oleh arus sungai jauh dari istana. Seorang wanita tua yang baik hati menemukan keong emas itu di tepi sungai. Ia membawanya pulang dan merawatnya dengan penuh kasih. Setiap malam, keong emas itu berubah menjadi Putri Candra Kirana dan membantu wanita tua itu mengerjakan pekerjaan rumah. Namun, keesokan harinya, ia kembali menjadi keong emas. Suatu hari, seorang pangeran dari kerajaan tetangga yang sedang berburu melihat keong emas itu berubah menjadi seorang putri. Pangeran itu jatuh cinta pada Candra Kirana dan memutuskan untuk mencari cara untuk mengangkat kutukan itu. Dengan bantuan seorang pertapa, mereka berhasil mengusir penyihir jahat dan Galuh Ajeng. Kutukan pada Candra Kirana pun terangkat dan ia berubah kembali menjadi manusia sepenuhnya. Pangeran itu membawa Candra Kirana dan wanita tua itu ke istana, di mana mereka hidup bahagia selamanya.",
            "english": "In the Daha Kingdom, there lived a beautiful princess named Candra Kirana. She had a stepsister named Galuh Ajeng, who was very jealous of her. One day, Galuh Ajeng conspired with an evil witch to curse Candra Kirana into a golden snail. The golden snail was carried away by the river's current far from the palace. A kind-hearted old woman found the golden snail on the riverbank. She took it home and cared for it with love. Every night, the golden snail turned into Princess Candra Kirana and helped the old woman with household chores. However, the next day, she turned back into a golden snail. One day, a prince from a neighboring kingdom who was hunting saw the golden snail turn into a princess. The prince fell in love with Candra Kirana and decided to find a way to lift the curse. With the help of a hermit, they managed to defeat the evil witch and Galuh Ajeng. The curse on Candra Kirana was lifted, and she fully turned back into a human. The prince took Candra Kirana and the old woman to the palace, where they lived happily ever after."
        },
        "id": {
            "english": "legend-of-keong-mas",
            "indonesian": "legenda-keong-mas"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Banyuwangi",
            "english": "Legend of Banyuwangi"
        },
        "synopsis": {
            "indonesian": "Seorang raja menuduh istrinya yang setia berselingkuh. Istrinya membuktikan kesuciannya dengan menceburkan diri ke sungai, dan air sungai itu menjadi jernih dan harum.",
            "english": "A king accuses his faithful wife of infidelity. His wife proves her purity by throwing herself into a river, and the river's water becomes clear and fragrant."
        },
        "full_story": {
            "indonesian": "Di kerajaan Blambangan, hiduplah seorang raja bernama Prabu Sulahkromo yang sangat mencintai istrinya, Raden Ayu Sritanjung. Namun, seorang patih yang jahat bernama Raden Sidopekso, yang juga mencintai Sritanjung, menyebarkan fitnah bahwa Sritanjung telah berselingkuh. Raja yang marah mempercayai fitnah itu dan memerintahkan agar Sritanjung dihukum mati. Sritanjung memohon kepada raja untuk membuktikan kesuciannya. Ia kemudian menceburkan diri ke sungai. Ajaibnya, air sungai yang awalnya keruh menjadi jernih dan harum setelah Sritanjung menceburkan diri. Raja yang menyadari kesalahannya menyesal dan mengubah nama sungai itu menjadi Banyuwangi, yang berarti 'air yang harum'. Sejak saat itu, Banyuwangi menjadi nama kota di daerah tersebut.",
            "english": "In the Blambangan Kingdom, there lived a king named Prabu Sulahkromo, who loved his wife, Raden Ayu Sritanjung, very much. However, an evil prime minister named Raden Sidopekso, who also loved Sritanjung, spread a rumor that Sritanjung had been unfaithful. The angry king believed the slander and ordered Sritanjung to be executed. Sritanjung pleaded with the king to prove her purity. She then threw herself into the river. Miraculously, the river's murky water became clear and fragrant after Sritanjung plunged into it. The king, realizing his mistake, regretted his actions and renamed the river Banyuwangi, which means 'fragrant water.' Since then, Banyuwangi has become the name of the city in the area."
        },
        "id": {
            "english": "legend-of-banyuwangi",
            "indonesian": "legenda-banyuwangi"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Asal Usul Kota Surabaya",
            "english": "Legend of the Origin of Surabaya"
        },
        "synopsis": {
            "indonesian": "Seekor buaya dan seekor hiu berseteru untuk menjadi penguasa wilayah. Pertarungan mereka menghasilkan nama kota Surabaya.",
            "english": "A crocodile and a shark dispute to become the ruler of the territory. Their battle gives rise to the name of the city Surabaya."
        },
        "full_story": {
            "indonesian": "Pada zaman dahulu, hiduplah seekor buaya yang sangat kuat bernama Baya dan seekor hiu yang sangat ganas bernama Sura. Mereka berdua memperebutkan wilayah kekuasaan di sebuah sungai. Mereka setuju untuk membagi wilayah mereka: Sura akan menguasai laut, dan Baya akan menguasai darat serta sungai. Namun, suatu hari, Sura melanggar kesepakatan dan masuk ke sungai yang menjadi wilayah Baya. Baya sangat marah dan terjadilah pertarungan sengit antara mereka berdua. Pertarungan itu berlangsung sangat lama hingga menyebabkan kerusakan di sekitar sungai. Akhirnya, Baya berhasil menggigit ekor Sura, dan Sura yang terluka parah melarikan diri ke laut. Tempat pertarungan mereka kemudian dikenal sebagai Surabaya, yang berasal dari nama Sura dan Baya. Surabaya sekarang adalah salah satu kota terbesar di Indonesia.",
            "english": "In ancient times, there lived a very strong crocodile named Baya and a very fierce shark named Sura. They both fought over territorial control of a river. They agreed to divide their territory: Sura would rule the sea, and Baya would rule the land and the river. However, one day, Sura broke the agreement and entered the river, which was Baya's territory. Baya was very angry, and a fierce battle ensued between the two. The fight lasted for a long time and caused damage around the river. Finally, Baya managed to bite Sura's tail, and the severely injured Sura fled to the sea. The place of their battle became known as Surabaya, derived from the names Sura and Baya. Surabaya is now one of the largest cities in Indonesia."
        },
        "id": {
            "english": "legend-of-the-origin-of-surabaya",
            "indonesian": "legenda-asal-usul-kota-surabaya"
        }
    },
    {
        "title": {
            "indonesian": "Legenda Jaka Tarub dan Nawang Wulan",
            "english": "Legend of Jaka Tarub and Nawang Wulan"
        },
        "synopsis": {
            "indonesian": "Seorang pemuda bernama Jaka Tarub mencuri selendang seorang bidadari bernama Nawang Wulan. Mereka menikah, tetapi rahasia itu akhirnya terbongkar.",
            "english": "A young man named Jaka Tarub steals the shawl of a celestial nymph named Nawang Wulan. They marry, but the secret is eventually revealed."
        },
        "full_story": {
            "indonesian": "Dahulu kala, di sebuah desa hiduplah seorang pemuda tampan bernama Jaka Tarub. Suatu hari, ia pergi ke hutan dan menemukan sekelompok bidadari yang sedang mandi di sebuah danau. Jaka Tarub mencuri salah satu selendang yang tergantung di tepi danau. Selendang itu milik seorang bidadari bernama Nawang Wulan. Setelah mandi, para bidadari kembali ke kahyangan, tetapi Nawang Wulan tidak bisa ikut karena selendangnya hilang. Jaka Tarub kemudian berpura-pura menemukan selendang itu dan mengajak Nawang Wulan untuk tinggal di desanya. Mereka akhirnya menikah dan hidup bahagia. Nawang Wulan memiliki kemampuan ajaib untuk memasak nasi hanya dengan sebutir padi. Namun, Jaka Tarub penasaran dan melanggar larangan Nawang Wulan untuk tidak membuka penutup panci saat memasak. Akibatnya, Nawang Wulan kehilangan kekuatan ajaibnya dan harus memasak nasi dengan cara biasa. Suatu hari, Nawang Wulan menemukan selendangnya yang tersembunyi di lumbung padi. Ia sangat sedih dan marah karena Jaka Tarub telah menipunya. Nawang Wulan memutuskan untuk kembali ke kahyangan dan meninggalkan Jaka Tarub. Sebelum pergi, ia memberikan pesan kepada Jaka Tarub untuk merawat anak mereka. Jaka Tarub sangat menyesal, tetapi ia tidak bisa menghalangi kepergian Nawang Wulan.",
            "english": "Long ago, in a village, there lived a handsome young man named Jaka Tarub. One day, he went into the forest and found a group of celestial nymphs bathing in a lake. Jaka Tarub stole one of the shawls hanging by the lake. The shawl belonged to a celestial nymph named Nawang Wulan. After bathing, the nymphs returned to the celestial realm, but Nawang Wulan could not follow because her shawl was missing. Jaka Tarub then pretended to find the shawl and invited Nawang Wulan to stay in his village. They eventually got married and lived happily. Nawang Wulan had a magical ability to cook rice with just a single grain. However, Jaka Tarub became curious and violated Nawang Wulan's prohibition not to open the pot lid while cooking. As a result, Nawang Wulan lost her magical power and had to cook rice the normal way. One day, Nawang Wulan found her shawl hidden in the rice barn. She was very sad and angry because Jaka Tarub had deceived her. Nawang Wulan decided to return to the celestial realm, leaving Jaka Tarub behind. Before leaving, she left a message for Jaka Tarub to take care of their child. Jaka Tarub was very regretful, but he could not stop Nawang Wulan from leaving."
        },
        "id": {
            "english": "legend-of-jaka-tarub-and-nawang-wulan",
            "indonesian": "legenda-jaka-tarub-dan-nawang-wulan"
        }
    }
]